"""
Дан массив, в котором среди прочих элементов есть слово odd(нечётный). Определите, есть ли в списке число, которое
является индексом элемента odd. Напиши функцию, которая будет возвращать True или False, соответственно.

print(odd_ball(["even", 4, "even", 7, "even", 55, "even", 6, "even", 10, "odd", 3, "even"])) - True
print(odd_ball(["even", 4, "even", 7, "even", 55, "even", 6, "even", 9, "odd", 3, "even"])) - False
print(odd_ball(["even", 10, "odd", 2, "even"])) - True
"""


def odd_ball(arr):
    pass
